# ░░░░░░░░░░░░░░░░░░░░░░
# ░░░░░░░░░░ █░░██░░░░░░
# ░░░░░░░░░██.█████░░░░░
# ░░░░░░░░░███ ████░░░░░
# ░░░░░░░░░░███ ██░░░░░░
# ░░░░░░░░░░░░██ ░░░░░░░
# ░░░░░░░░░░░░░░░░░░░░░░
# ░░░░░░░░░█▔█░░█░█░░░░░
# ░░░░░░░░░██░░░░█░░░░░░
# ░░░░░░░░░█▁█░░░█░░░░░░
# ░░░░░░░░░░░░░░░░░░░░░░
# ░░░███░███░███░███░███
# ░░░░░█░█░░░░█░░█░░░█░█
# ░░░░█░░███░░█░░█░█░█░█
# ░░░█░░░█░░░░█░░█░█░█░█
# ░░░███░███░░█░░███░███
# H:Mods Team [💎]


# meta developer: @nullmod

from .. import loader

def generator(
    rows: int, # Л
    columns: int, # Е
    *buttons: dict, # Н
    navigation: False = bool, # Ь
    back_to: None = dict # !
):
    pass

def buttons():
    pass

@loader.tds
class debugger(loader.Module):
    """Docstring"""
    async def cmdcmd():
        generator(3,3,)